import streamlit as st
st.sidebar.write("เเนะนำหนัง")
with st.sidebar:
    a1 = st.tabs(["ลงชื่อใช้งาน"])
    username = st.text_input('ชื่อผู้ใช้')
    old = st.number_input("อายุ")
    if st.button('เข้าสู่ระบบ'):
       st.title(username)
       st.write('ชื่อผู้ใช้:', username)
       st.write('อายุ:', old)
       w = st.columns(1)
x1,x2,x3,x4, = st.tabs(["หน้าเเรก","เเนว","หนังดีที่สุดตลอดกาล","รีวิว"])
with x1:
    st.title('เเนะนำ :blue[Movie] :red[น่าดู] ')
    st.write("หากคุณไม่รู้ว่าจะดูหนังเรื่องไหนดี เราจะเเนะนำคุณเอง")
    a,s,d = st.columns(3)
    with a:
        st.header("อวตาร")
        st.image("Avatar_poster.jpg", width=200)
        agree = st.checkbox('ข้อมูล')
        if agree:
           st.write("กำกับ	เจมส์ แคเมรอน")
           st.write("เขียนบท	เจมส์ แคเมรอน")
           st.write("วันฉาย	10 ธันวาคม ค.ศ. 2009")
           st.write("ทำเงิน	2.923 พันล้านดอลลาร์สหรัฐ")

    with s:
        st.header("สตาร์ วอร์ส")
        st.image("star.jpg", width=200)
        ag = st.checkbox('ข้อมูล  ')
        if ag:
           st.write("สร้างโดย	จอร์จ ลูคัส")
           st.write("งานต้นฉบับ	สตาร์ วอร์ส")
           st.write("เจ้าของ	ลูคัสฟิล์ม")

    with d:
        st.header("Tokyo Drift")
        st.image("The_Fast_and_the_Furious_-_Tokyo_Drift_poster.jpg", width=200)
        agree = st.checkbox('ข้อมูล     ')
        if agree:
           st.write('กำกับ	จัสติน ลิน')
           st.write("เขียนบท	คริส มอแกน")
           st.write("ตัดต่อ	เคลลี มัตสึโมโตะ")
           st.write("ทุนสร้าง	85 ล้านดอลลาร์สหรัฐ")
           st.write("ทำเงิน	158.9 ล้านดอลลาร์สหรัฐ")

with x2:
    st.title('เเนะนำ :blue[Movie] :red[Top5] ')
    option = st.selectbox(
       "How would you like to be contacted?",
       ("แอ็คชั่น", "ดราม่า", "คอมเมดี้"),
       index =None,
       placeholder="อยากดูเเนวไหน....",
    )
    st.write('คุณเลือก:', option) 
    if option == "คอมเมดี้":
       if st.button('เลือก'):
          st.write('เเนวคอมเมดี้')
          col1, col2, col3, col4, col5 = st.tabs(["อ้ายคนหล่อลวง","7 ประจัญบาน","ไทบ้าน เดอะซีรีส์","เท่ง โหน่ง จีวรบิน","บอดี้การ์ดหน้าเหลี่ยม"])

          with col1:
             st.header("อ้ายคนหล่อลวง")
             st.image("อ้ายคนหล่อ.jpg", width=200)
             st.write("หนังตลกไทยที่ไม่ได้เน้นฮาอย่างเดียว แต่ยังมีเนื้อหาซึ้งๆ ให้อินตามกันอีกด้วย เล่าเรื่องราวของหญิงสาวพนักงานบริษัทสินเชื่อแห่งหนึ่ง ที่คิดอยากแก้แค้นแฟนเก่าที่เคยมาหลอกเงินจากตัวเอง เธอจึงไปติดต่อหนุ่มนักต้มตุ๋นมืออาชีพให้ช่วยวางแผนให้ จนนำไปสู่เรื่องป่วนๆ วุ่นวาย และความสัมพันธ์ของทั้งคู่ก็ค่อยๆ ก่อตัวขึ้น โดยหนังไทยเรื่องนี้ยังคว้าตัว แบมแบม-กันต์พิมุกต์ ภูวกุล ศิลปินจากวงบอยแบนด์ GOT7 มาร่วมร้องเพลงประกอบด้วย")
          with col2:
             st.header("7 ประจัญบาน")
             st.image("7ประจัญบาน.jpg", width=200)
             st.write("เรื่องราวของภาพยนตร์เริ่มต้นขึ้นเมื่อกลุ่มทหารทั้ง 7 ของ กองพลทหารอาสาสมัคร เสร็จสิ้นภารกิจเสี่ยงตายสุดท้ายใน สงครามเวียดนาม พวกเขาเกษียณจากกองทัพและกลับมาใช้ชีวิตต่อตามปกติร่วมกับครอบครัวของพวกเขา อย่างไรก็ตาม ความทรงจำอันแสนเลวร้ายยังคงหลอกหลอนพวกเขา ต่อมา มีพ่อค้าจ้างพวกเขาให้ขโมยทองจากรถบรรทุก โชคไม่ดีรถบรรทุกคันนั้นเป็นของจีไอ แห่ง กองทัพสหรัฐ เหล่าทหารจีไอโกรธและพยายามจับเหล่า 7 ประจัญบานโดยโจมตีหมู่บ้านของพวก 7 ประจัญบาน หลังจากทหารสหรัฐจับตัวชาวบ้านทุกคน พวกเขาทำให้ชาวบ้านทุกคนเป็นทาส ขณะเดียวกัน เหล่าเจ็ดประจัญบานได้รู้ว่าในรถบรรทุกไม่ใช่ทองแต่เป็นสารเคมี ฝนเหลือง ที่ใช้ถล่มป่าในเวียดนาม จากนั้นพวกเขาเดินทางไปยังค่ายทหารอเมริกัน และต่อสู้กับพวกทหารอเมริกันจนประสบความสำเร็จในการช่วยชาวบ้าน โดยภาพยนตร์จบลงด้วยการที่ จุก บวชให้กับแม่โดยแม่มีความสุขและสิ้นใจในที่สุด")
          with col3:
             st.header("ไทบ้าน เดอะซีรีส์")
             st.image("ไทบ้าน เดอะซีรีส์.jpg", width=200)
             st.write("เรื่องราวของวัยรุ่นหนุ่มสาวอีสาน โดยจาลอดผู้บ่าวไทบ้าน ขี้อาย ชีวิตไม่เคยมีแฟนเลย ต้องมาจีบสาวหนึ่งร้อยคน โดยเชื่อว่าต้องมีสักคนที่ตอบรับคำขอเป็นแฟน แต่ปัญหาก็เกิดขึ้นเมื่อการจีบสาวหนึ่งร้อยคนต้องใช้เงินเป็นจำนวนมาก เลยได้ไปสมัครเป็นภารโรงที่ รร.ประถม ซึ่งมีแก้วมาเป็นครูฝึกสอน อีกด้านของเฮียป่อง (เพื่อนสนิทของจาลอด) นักธุรกิจหนุ่มไฟแรงพึ่งจบจากกรุงเทพมาใหม่ ๆ ต้องการมาเปิดเซเว่นในหมู่บ้านตัวเองที่อยู่บ้านนอก แต่พ่อของเขากลับไล่ให้ไปทำนาซึ่งมันไม่ใช่ทางของเขาเลย")
          with col4:
             st.header("เท่ง โหน่ง จีวรบิน")
             st.image("เท่งโหน่งจีวรบิน.jpg", width=200)
             st.write("เมื่อโชคชะตาชวนศรัทธามาร่วมกันผ่าวิกฤตกับสถานการณ์ที่พร้อมพลิกและผันอยู่หลายตลบ ทำให้ พระเท่ง ที่หลบลี้หนีความวุ่นวายไปจำศีลภาวนาอยู่ที่ต่างประเทศหลายปีน่าจะได้มีโอกาสกลับมาจำวัดที่ประเทศไทยอย่างสะดวกโยธินซะที ถ้าตั๋วเครื่องบินโดยสารไม่ดันเต็มไปเสียก่อน เฉกเช่นกับที่ เสี่ยโหน่ง พ่อค้าอัญมณีเศรษฐีผู้มั่งคั่งและมากล้นไปด้วยอิทธิพลไม่บังเอิญมาติดต่อธุรกิจที่นี่พอดี ถึงเป็นผู้มีอิทธิพลแต่ก็ยังมีกุศลจิตจึงตัดสินใจนิมนต์พระเท่งให้โดยสารเครื่องบินแบบเช่าเหมาลำเดินทางกลับมาพร้อมกัน จึงเป็นจุดเริ่มต้นอันนำไปสู่การเดินทางผจญภัยฝ่าสารพัดวิบากกรรมที่ครั้งหนึ่งจะเกิดขึ้นในชีวิตของคนที่เกิดมาเป็น “พระ” และอีกคนที่เกิดมาเป็น “เสี่ย”")
          with col5:
             st.header("บอดี้การ์ดหน้าเหลี่ยม")
             st.image("บดิการ์ด.jpg", width=200)
             st.write("เนื้อเรื่องเล่าถึง วงศ์คม (หม่ำ จ๊กมก) บอดี้การ์ดจากภาคอีสานผู้ต้องปกป้อง ท่านโชติ เพชรพันธการ (สุรชัย จันทิมาธร) อภิมหาเศรษฐีผู้ร่ำรวย และ ชายชล เพชรพันธการ (พิพัฒน์ อภิรักษ์ธนากร) บุตรชายของท่านโชติจากแผนการอันชั่วร้ายของ ช่วง เพชรพันธการ (สุเทพ ประยูรพิทักษ์) น้องชายแท้ๆของท่านโชติและทรงพล (วัชระ ปานเอี่ยม) ลูกน้องคนสนิทของช่วงแต่ในระหว่างงานเลี้ยง ท่านโชติกลับถูกลอบสังหารวงศ์คมจึงต้องปกป้องชายชลโดยได้ ป๊อก (ภุมวารี ยอดกมล) สาวอาสาสมัครมูลนิธิร่วมกตัญญู,แม่แจ่มจันทร์ (อาภาพร นครสวรรค์) แม่ของป๊อกเป็นผู้ช่วยโดย คุณหญิงรัตนา เพชรพันธการ (อรัญญา นามวงศ์) ภรรยาของท่านโชติให้การสนับสนุน")
       else:
           pass 
    if option == "แอ็คชั่น":
       if st.button('เลือก'):
          st.write('เเนวแอ็คชั่น')
          col1, col2, col3, col4, col5 = st.tabs(["ขุนพันธ์","องค์บาก","ฅนไฟบิน","4 KINGS","ต้มยำกุ้ง"])

          with col1:
             st.header("ขุนพันธ์")
             st.image("ขุนพันธ์.jpg", width=200)
             st.write("ปี พ.ศ. 2483 หลังปราบเสือกรับ คำทองได้สำเร็จ ร้อยตำรวจโท ขุนพันธรักษ์ราชเดชได้รับภารกิจให้ไปสืบข่าวอัลฮาวียะลู จอมโจรแบ่งแยกดินแดน ผู้ครอบครอง ไตรภาคี ของหายาก 3 สิ่งที่เชื่อว่ามีพลังวิเศษ ขุนพันธ์แฝงตัวเข้าไปอยู่ในหมู่บ้านชาวประมงที่มีผู้นำคือ ไข่โถ และทำงานในสโมสรงาช้างของหลวงโอฬาร ข้าราชการผู้ฉ้อฉลที่หลอกใช้อัลฮาวียะลูเพื่อผลประโยชน์ส่วนตัว ด้านอัลฮาวียะลูเค้นถามตำรวจสองนายที่รอดชีวิตจากการถูกกองโจรของตนซุ่มโจมตีจนพบว่า ยังมีตำรวจนายหนึ่งแฝงตัวอยู่ในพื้นที่ ขุนพันธ์เดินทางไปพบพ่อของอัลฮาวียะลูและพบว่าในวัยเด็ก อัลฮาวียะลูเคยเทิดทูนพ่อ แต่สูญเสียแม่จากเหตุชุลมุนระหว่างพ่อของเขากับตำรวจ จึงทำให้อัลฮาวียะลูห่างเหินกับพ่อและเกลียดตำรวจมาก เขาตั้งกองโจรขึ้นมาเพื่อปกครองพื้นที่แถบเทือกเขาบูโด เวลาต่อมา ขุนพันธ์ไปพบมาลัย น้องสาวของไข่โถก่อนจะถูกกองโจรของอัลฮาวียะลูซุ่มโจมตี ขุนพันธ์ถูกยิงแต่หนีรอดไปได้")
          with col2:
             st.header("องค์บาก")
             st.image("Ong_1.jpg", width=200)
             st.write("องค์บาก พระพุทธรูปศักดิ์สิทธิ์ ซึ่งเป็นที่เคารพบูชาของหมู่บ้านหนองประดู่ ได้ถูกขโมยตัดเศียรไป บุญทิ้ง (ทัชชกร ยีรัมย์) หนุ่มบ้านหนองประดู่ จึงอาสาออกตามหามาจนถึงกรุงเทพฯ จนได้เจออ้ายหำแหล่หรือ ยอร์จ (หม่ำ จ๊กมก) ลูกชายผู้ใหญ่บ้านที่ทิ้งท้องนาและกลิ่นโคลนสาปควายบ้านนอก มาร่วมทีมกับ หมวยเล็ก (ภุมวารี ยอดกมล) มาเป็น 18 มงกุฎ ต้มตุ๋นชาวบ้านเพื่อเลี้ยงปากท้องบุญทิ้งจึงไม่วายเป็นเหยื่อเพราะความซื่อ แต่ด้วยความที่เป็นคนดีและเคยช่วยเหลือชีวิตทั้งสองไว้ ภายหลังเขาจึงได้รับความช่วยเหลือจากทั้งสองในการตามหาองค์บาก พร้อมถูกดึงเข้าสู่การต่อสู้กับเจ้าพ่อมาเฟียอิทธิพลมืดจนเกือบเอาชีวิตไม่รอด บุญทิ้งจึงขอต่อสู้ทั้งชีวิตด้วยศิลปะมวยไทยโบราณตลอดจนการเดินทางตามหาองค์บากเพื่อนำกลับคืนสู่หมู่บ้านให้ทันพิธีอุปสมบทหมู่ซึ่งจะจัดขึ้นในอีก 7 วันให้ได้")
          with col3:
             st.header("ฅนไฟบิน")
             st.image("ฅน.jpg", width=200)
             st.write("ในอดีตเมื่อการเดินทางไกลยังใช้ควายเทียมเกวียนเป็นหลัก นายฮ้อยผู้มีวิชาต่อสู้ติดตัวมีหน้าที่ดูแลขบวนคาราวาน ต่อมาเมื่อพระยาแหว่งนำรถไถฝรั่งเข้าสู่โคราชเพื่อหวังค้ากำไรแก่ชาวนา ด้วยราคาที่แพงไปและชาวนายังนิยมใช้ควาย พระยาแหว่งจึงหันไปร่วมมือกับปอบดำ ผู้มีวิชาอาคมวางแผนฆ่าคาราวานวัวควายให้หมด เพื่อทุกคนจะใช้รถไถฝรั่งแทน มีเพียงแค่โจรบั้งไฟผู้มีอาวุธร้ายเป็นบั้งไฟบินคนเดียวเท่านั้นที่จะหยุดยั้งแผนการชั่วนี้ได้")
          with col4:
             st.header("4 KINGS")
             st.image("4_KINGS_poster.jpg", width=200)
             st.write("เรื่องราวของภาพยนตร์เกิดขึ้นในปี พ.ศ. 2538 โดยเล่าผ่านความทรงจำของบิลลี อดีตนักศึกษาอาชีวะที่ผันตัวมาเป็นพ่อเลี้ยงเดี่ยวกับลูกสาววัยรุ่นของเขา แม้ว่าความสัมพันธ์ระหว่างพ่อกับลูกสาวจะไม่ค่อยดีนัก แต่เมื่อลูกสาวของเขาได้รับบาดเจ็บจากการต่อสู้ของแก๊งเด็กอาชีวะ ทำให้บิลลีหวนนึกถึงอดีตของตัวเองและเพื่อน ในยุค 90 มีวิทยาลัยอาชีวะชื่อดังมากมายแต่มีอยู่ 4 สถาบันที่โดดเด่น คือ อินทรอาชีวศึกษา ช่างกลบุรณพนธ์ เทคโนโลยีประชาชล และกนกอาชีวะ พวกเขามีชื่อเล่นว่า 4 KINGSบิลลีรู้สึกหดหู่ใจเมื่อแม่ของเขาแต่งงานใหม่และพ่อเลี้ยงก็เกลียดเขา ทางออกเดียวของเขาคือเพื่อนสนิท ดังนั้นเขาจึงต้องทำทุกอย่างเพื่อรักษาและปกป้องมิตรภาพของเขากับเพื่อนร่วมสถาบันของเขา บิลลีพบกับความขัดแย้งทุกรูปแบบรวมถึงสูญเสียเพื่อนรักไป นับเป็นบทเรียนชีวิตครั้งใหญ่ที่เขาต้องตอบแทนมาจนถึงทุกวันนี้")
          with col5:
             st.header("ต้มยำกุ้ง")
             st.image("TYG1.jpg", width=200)
             st.write("การเดินทางข้ามโลกของ “ขาม” (จา พนม ยีรัมย์) เด็กหนุ่มบ้านป่าที่ชีวิตต้องพลิกผันโดยเงื้อมมือของผู้มีอิทธิพลระดับประเทศที่ลักพาช้างพลายสองพ่อลูก ซึ่งเด็กหนุ่มและ “พ่อของขาม” (โสรธร รุ่งเรือง) เขารักดั่งชีวิต และมีความมุ่งหมายอันสูงสุดที่จะมอบเป็นคชบาทแด่ในหลวง ไปขาย ณ ประเทศออสเตรเลีย ทางเดียวที่จะช่วยเหลือและรักษาชีวิตของช้างอันเป็นที่รักของเขาได้ นั่นก็คือ การบุกตะลุยถึงถิ่นเสือ โดยการเดินทางข้ามโลกเรื่องไม่ง่ายอย่างใจคิด แม้เขาจะได้รับความช่วยเหลือจาก “จ่ามาร์ค” (หม่ำ จ๊กมก) นายตำรวจไทยและ “ปลา” (บงกช คงมาลัย) สาวไทยที่ถูกหลอกมาขายตัวในซิดนีย์ก็ตาม แต่ที่นั่น เขากลับต้องไปพัวพันกับการไล่ล่าของแก๊งมาเฟียที่นำโดย “มาดามโรส” (จิน ซิง) ที่มีลูกสมุนต่างชาติที่เต็มไปด้วยฝีมือทางการต่อสู้อย่าง “จอห์นนี่” (จอห์นนี่ เหงียน) และ “ทีเค” (นาธาน โจนส์) พร้อมลูกสมุนย่อยที่มีฝีไม้ลายมือทางการต่อสู้เหลือรับอย่าง “คาโปเอร่า” (ลาธีฟ คราวเดอร์) และ “วูซู” (จอน ฟู) อย่างไม่ได้ตั้งใจณ วินาทีนี้ การต่อสู้ข้ามชาติเพื่อเอาชีวิตรอดของเด็กหนุ่มและเพื่อนพ้อง ได้เริ่มต้นขึ้นแล้ว เพื่อตามหาและช่วยเหลือ พ่อใหญ่ และ ขอน ช้างพ่อลูก ที่เปรียบได้กับญาติพี่น้องของเขา นำไปสู่บททดสอบและการต่อสู้ครั้งสำคัญที่สุดในชีวิตของเขาให้โลกได้ล่วงรู้ถึง อานุภาพของ ไม้มวยไทยโบราณ ที่หนักหน่วง รุนแรง และยังไม่เคยได้รับการเปิดเผยมาก่อน โดยเฉพาะ ตำนานมวยคชสาร")
       else:
           pass 
    if option == "ดราม่า":
       if st.button('เลือก'):
          st.write('เเนวดราม่า')
          col1, col2, col3, col4, col5 = st.tabs(["น้อง.พี่.ที่รัก","แสงกระสือ","เฉิ่ม","สัปเหร่อ","สิ่งเล็กเล็กที่เรียกว่า...รัก"])

          with col1:
             st.header("น้อง.พี่.ที่รัก")
             st.image("โปสเตอร์น้อง.พี่.ที่รัก.jpg", width=200)
             st.write("เนื้อเรื่องย่อตั้งแต่เด็ก 'ชัช' (ซันนี่ สุวรรณเมธานนท์) คิดมาตลอดว่าน้องที่อยู่ในท้องแม่คือ น้องชาย พอถึงวันที่แม่คลอดแล้วกลายเป็นน้องสาว ชัชจึงเซ็งระดับสิบ ความฝันที่จะได้เล่นหุ่นยนต์และเตะบอลแมนๆกับน้องก็จบไป เพราะเล่นกับไอ้ 'เจน' (อุรัสยา เสปอร์บันด์) ทีไร มันก็ร้องไห้งอแงทุกที ตั้งแต่เด็กจนโต ชัชกับเจนตีกันได้ทุกเรื่อง เพราะเจนชอบทำตัวเหมือนเป็นแม่มากกว่าเป็นน้อง ส่วนชัชก็ชอบทำตัวเป็นภาระมากกว่าเป็นพี่ จะมีพี่ชายคนไหนที่ห่วยกว่าน้องสาวไปซะทุกด้าน ไม่ว่าจะเป็นเรื่องการเรียน กีฬา หน้าตา นิสัย แข่งกันยังไง เจนก็เพอร์เฟคกว่า เวลาเดียวที่ชัชจะโชว์เหนือทำตัวเป็นพี่ ก็คือตอนที่มีคนมาจีบเจน ชัชจะทำตัวกร่างไล่หนุ่มๆให้หนีหายไปหมด เหมือนเป็นการเอาคืนนั่นจึงเป็นเหตุผลที่เจนต้องปิดบังความรักระหว่างเธอกับ 'โมจิ' (นิชคุณ หรเวชกุล) ชายหนุ่มลูกครึ่งญี่ปุ่น สุดเพอร์เฟค เพราะเจนไม่อยากให้รักครั้งนี้ต้องพังยับด้วยน้ำมือของพี่ชัชเหมือนที่ผ่านมา แต่ความรักไม่ใช่ความลับ ชัชรู้จนได้ว่าเจนกับโมจิแอบคบกัน แล้วมีเหรอที่ชัชจะยอมปล่อยผ่าน ก็บอกแล้วว่าอะไรที่ทำให้น้องมีความสุข พี่ชายที่แสนดีอย่างชัชจะไม่มีวันยอมให้เกิดขึ้นแน่นอน!! ")
          with col2:
             st.header("แสงกระสือ")
             st.image("InhumanKissPoster.jpg", width=200)
             st.write("“แม้ร่างกายจะเปลี่ยนไป แต่หัวใจจะเป็นเหมือนเดิม” เด็กสาวแรกรุ่นในหมู่บ้านอันห่างไกลค้นพบว่า แท้จริงแล้วเธอไม่ใช่มนุษย์เหมือนคนอื่น แต่สืบเชื้อสายมาจาก เผ่าพันธุ์เก่าแก่ในตำนานที่ถ่ายทอดกันผ่านทางน้ำลาย มีเพียงเด็กหนุ่มคนเดียวในหมู่บ้านที่รู้ความจริงและพยายามปกป้องเธอจากการไล่ล่าของชาวบ้านที่หวาดกลัวผีกระสือ ความใกล้ชิดของทั้งสองเริ่มก่อตัวขึ้นเป็นความรัก ขณะที่อสูรกายอีกสายพันธุ์หนึ่งก็ต้องการหัวใจของเธอเพื่อความเป็นอมตะ หนทางที่เธอจะอยู่รอดคือหนีออกจากหมู่บ้านหรือการเผชิญหน้ากับศัตรูที่ตามล่าแล้วเขาจะปกป้องเธอได้หรือไม่")
          with col3:
             st.header("เฉิ่ม")
             st.image("เฉิ่ม.jpg", width=200)
             st.write("เรื่องราวความรักและความผูกพันของ สมบัติ ดีพร้อม (เพ็ชรทาย วงศ์คำเหลา หรือ หม่ำ จ๊กมก) คนขับรถแท็กซี่กะดึก ผู้มีบุคลิกเฉิ่มๆ เหมือนกับชื่อภาพยนตร์ ชอบฟังเพลงสุนทราภรณ์ทางวิทยุเอเอ็ม ชอบเขียนจดหมายเข้าไปในรายการวิทยุ ชอบกินต้มเลือดหมูร้านเดิมๆ เหมือนกันทุกวัน คนขับแท็กซี่ที่มีอดีตที่ขมขื่น กับ นวล (วรนุช วงษ์สวรรค์) สาวบริการในอาบอบนวด")
          with col4:
             st.header("สัปเหร่อ")
             st.image("สัปเหร่อ_(ภาพยนตร์).jpg", width=200)
             st.write("เรื่องราวที่ต่อจากไทบ้าน เดอะซีรีส์ 2.2 เล่าถึงชีวิต เจิด เด็กหนุ่มวัย 25 ปีที่เรียนจบกฎหมาย 7-8 ปี มีพ่อทำอาชีพสัปเหร่อ เขาหวังจะไปสอบเป็นทนายหรือปลัดอำเภอ แต่ต้องมาช่วยพ่อเป็นสัปเหร่อ เพราะพ่อมีอาการป่วยจนต้องมาช่วยพ่อทำงาน แต่ลังเลเพราะเจิดเป็นคนที่กลัวผี และต้องมาทำงานกับศพเซียง เป็นผู้อกหักจากคนรักและพยายามบวชเพื่อลืมแฟนเก่า แต่สุดท้ายต้องมาเจ็บปวดเพราะเเฟนเก่าตาย และทำใจไม่ได้จึงหาวิธีที่จะเจอ กับแฟนเก่าอีกครั้งในโลกหลังความตาย จึงเรียนรู้และศึกษาทฤษฎีต่างๆ เกี่ยวกับการเจอคนที่ตายไปแล้ว ไปปรึกษาพ่อของเจิดที่รอการทำพิธีถอดจิตไปโลกความฝันสามารถเจอคนที่ตายแล้วได้ พ่อของเจิดมีข้อแลกเปลี่ยนในการทำพิธีให้โดยเซียงต้องมาช่วยเจิดทำงานสัปเหร่อ เพราะเจิดเป็นคนที่กลัวผีมากๆ และต้องมาทำศพแทนพ่อ เซียงเป็นคนสุดท้ายที่พอจะได้ทำพิธีถอดจิตให้ก่อนตาย สุดท้ายทุกอย่างมีเวลาของมัน มันคือธรรมชาติของความจริงเวลาต่อมาเซียงได้สติด้วยความรักของยายและปริมที่ทำให้เขาสามารถปล่อยวางเรื่องการเจอแฟนเก่าผ่านการถอดจิตและเริ่มความรักครั้งใหม่กับปริม ผู้หญิงที่เสียสละทุกอย่างเพื่อครอบครัวเขามาตลอด เจิดที่กำลังจะไปสอบเป็นทนายความตามความตั้งใจ แต่จะไม่ลืมเกียรติของสัปเหร่อ มองรูปศักดิ์และแม่ผู้ล่วงลับ ด้วยความภาคภูมิใจก่อนจะนั่งรถออกไปสนามสอบพร้อมกับแจ็ค พร้อมที่จะใช้ชีวิตในการทำสิ่งที่รักที่สุดเท่าที่ชีวิตเหลืออยู่ตามที่ศักดิ์ได้บอกก่อนไปสู่สุคติ")
          with col5:
             st.header("สิ่งเล็กเล็กที่เรียกว่า...รัก")
             st.image("First_Love.jpg", width=200)
             st.write("น้ำสาวน้อย ม.1 วัย 14 หน้าตาธรรมดา ๆ และไม่สวย แต่เธอไปแอบชอบ พี่โชน พี่ม.4 ที่หล่อ เท่ ที่สุดในโรงเรียน แล้วแถมยังใจดีอีกต่างหากทำให้น้ำมีคู่แข่งเป็นสาว ๆ ทั้งม.ต้นและม.ปลาย ที่มีแต่คนสวย ๆ เต็มไปหมด แต่น้ำไม่ยอมแพ้ง่าย ๆ เธอพยายามลุยทำทุกอย่าง สู้ทุกรูปแบบเพื่อที่จะเก่งและสวย แล้วเด่นขึ้นในโรงเรียนให้ได้ เพราะแอบหวังในใจเล็ก ๆ ว่าถ้าทำสำเร็จพี่โชนอาจจะหันมามองเธอซักครั้งน้ำทำตั้งแต่เอามะขามเปียกมาขัดผิว สมัครเป็นนางรำแม้จะถูกคัดออก หัดเป่าคาริเน็ตแล้วสมัครเข้าวงโยธวาทิตเพื่อที่จะได้อยู่ใกล้ ๆ พี่โชน ด้วยความช่วยเหลือของเพื่อน ๆ แก๊งหน้าแย่ ในที่สุดน้ำก็ได้เป็นดรัมเมเยอร์มือหนึ่งของจังหวัด จนตอนที่เรียนอยู่ ม.3 เธอได้เป็นดาวของโรงเรียน น้ำตกเป็นเป้าสายตาของหนุ่ม ๆ ทั้งโรงเรียน มีคนเข้ามาจีบเป็นสิบ ๆ คน ยกเว้น โชน คนที่เธอรอคอยอยู่คนเดียวน้ำไปสารภาพ​รักกับพี่โชนในวันสุดท้ายของวันสอบและน้ำก็ได้อกหักกลับมาเพราะโชนได้เป็นแฟนกับปิ่นแต่ในใจลึกๆของโชนแล้วนั้นยังคงรักน้ำมาตั้งแต่ตอนที่น้ำยังไม่สวย ผ่านไป 9 ปี ทั้งโชนและน้ำ ได้มาพบกันในรายการทีวีรายการหนึ่ง...")
       else:
           pass
with x3:
   st.title('The best :blue[Movie] :red[Top10] ')
   s1,s2,s3,s4,s5,s6,s7,s8,s9,s0 = st.tabs(["The Shawshank Redemption (1994)","The Godfather (1972)","The Godfather - Part II (1974)","The Dark Knight (2008)","12 Angry Men (1957)","Schindler's List (1993)","The Lord of the Rings: The Return of the King (2003)","Pulp Fiction (1994)","The Good, the Bad and the Ugly (1966)","The Lord of the Rings: The Fellowship of the Ring (2001)"])
   with s1:
      st.header("The Shawshank Redemption (1994)")
      st.image("Shawshank.jpg", width=200)
      st.write("หนังสร้างจากนวนิยายของเจ้าพ่อนิยายสยองขวัญอย่าง สตีเวน คิง ที่ว่าด้วยเรื่องราวของ แอนดี้ นายธนาคารที่โดนจับข้อหาฆาตกรรมภรรยา และชู้รักของเธอ ทำให้เขาต้องถูกคุมขังอยู่ที่เรือนจำชอว์แชงก์ ซึ่งที่นั่นเขาก็ได้พบกับ เรด ชายผิวสีที่อยู่ในเรือนจำแห่งนี้มานานหลายสิบปี ที่ภายหลังทั้งคู่ได้กลายเป็นเพื่อนสนิทกัน พร้อม]bทั้ง แอนดี้ก็ได้พบกับมิตรภาพมากมายของเพื่อนนักโทษ ที่เขาไม่ได้สัมผัสจากโลกภายนอกหนึ่งในสุดยอดหนังดราม่า ที่แม้จะผ่านมานานกว่า 20 ปี แต่หลาย ๆ ฉากของหนังเรื่องนี้ก็ยังเป็นที่พูดถึง และตราตรึงต่อนักดูหนังหน้าเก่า หน้าใหม่ โดยเฉพาะประเด็นเรื่องมิตรภาพ และความหวังที่หนังถ่ายทอดออกมาได้ดีมาก ๆ ทำให้ไม่น่าแปลกที่หนังเรื่องนี้ จะกลายเป็นหนังโปรดของใครหลาย ๆ คนจนถูกโหวตให้เป็นอันดับ 1 ของเว็บ IMDB ด้วยคะแนน 9.3 คะแนน จากคนโหวตกว่า 2 ล้านคน")
   with s2:
      st.header("The Godfather (1972)")
      st.image("Godfather_ver1.jpg", width=200)
      st.write("สุดยอดหนังมาเฟียในตำนาน ผลงานการกำกับของ ฟรานซิส ฟอร์ด คอปโปล่า ที่ดัดแปลงมาจากนิยายของ มาริโอ พูโซ ที่เล่าเรื่องราวของ ดอน วีโต้ โคเลโอเน เจ้าพ้อชาวอิตาลีผู้ทรงอิทธิพลมาเนิ่นนาน จนกระทั่งเขาถูกเล่นงานจากแก๊งค้ายาเสพติด ทำให้ครอบครัว และแก๊งของเขาต้องมองหาคนที่จะมาสืบทอดเจตนารมณ์ของ ดอน นั่นก็คือ ไมเคิล ลูกชายของดอน ที่พึ่งกลับมาจากรับใช้ชาติ หลังจากนั้น ไมเคิล ก็ต้องก้าวเข้ามาสู่วงการเจ้าพ่อ และกอบกู้ศักดิ์ศรีของตระกูลให้กับมาอีกครั้งหนึ่งในหนังมาเฟียที่ยอดเยี่ยมที่สุดมาจนถึงทุกวันนี้ โดยหนังได้พาคนดูเข้าไปพบกับโลกของมาเฟียอิตาลีออกมาได้อย่างสมจริง ด้านตัวละครหนังก็ถ่ายทอดออกมาได้อย่างมีมิติ โดยเฉพาะ ดอน และ ไมเคิล โคเลโอเน ที่หนังได้สะท้อนความสัมพันธ์ของพ่อลูก และอิทธิพลของตระกูลพวกเขาที่มีต่อผู้คนได้อย่างทรงพลัง และการแสดงของ มารอน แบรนโด ในบท ดอน ที่คว้ารางวัลออสการ์สาขานักแสดงนำชายมาได้ ยังคงเป็นที่ตราตรึงมาจนถึงทุกวันนี้ พร้อมประโยคเด็ดที่ว่า ผมจะยื่นข้อเสนอ ที่คุณไม่อาจปฏิเสธ")
   with s3:
      st.header("The Godfather - Part II (1974)")
      st.image("Godfather_part_ii.jpg", width=200)
      st.write("ภาคที่สองของหนังชุด The Godfather ที่จะพาทุกคนไปพบกับเรื่องราวของ ไมเคิล โคเลโอเน หลังจากที่เข้ามารับตำแหน่งหัวหน้าของตระกูลอย่างเต็มตัว เขาก็ต้องพบกับปัญหา และอุปสรรคใหม่ ๆ ที่ยาก และท้าทายกว่าเดิม ในขณะเดียวกันหนังก็จะพาทุกคนย้อนกลับไปยังจุดเริ่มต้นของตระกูลโคเลโอเน ในโลกมาเฟีย กับจุดเริ่มต้นของ ดอน โคลิโอเน ในวัยหนุ่ม ว่าแท้จริงแล้วเขานั้นได้กลายมาเป็นผู้มีอิทธิพลคนสำคัญได้อย่างไร และเขาต้องผ่านอุปสรรคอะไรมาบ้างหลังจากความประสบความสำเร็จในภาคแรก ในหนังภาคที่สองนี้เป็นการพาคนดูเข้าไปพบกับโลกของมาเฟียผ่านตระกูลโคเลโอเน ที่มาพร้อมเรื่องราวที่เข้มข้น น่าติดตาม นอกจากนี้หนังยังได้สองดาราตัวพ่อแห่งยุคมาร่วมงานกันครั้งแรก(แม้ในหนังทั้งสองจะไม่ได้เข้าฉากด้วยกันก็ตาม) อย่าง โรเบิร์ต เดอ นีโร และอัล ปาชิโน ที่ต่างถ่ายทอดบทบาทมาเฟียรุ่นพ่อ และรุ่นลูกออกมาได้อย่างทรงพลัง จนหลาย ๆ คนยกให้เป็น The Godfather ภาคที่ชอบที่สุดในทั้ง 3 ภาค")
   with s4:
      st.header("The Dark Knight (2008)")
      st.image("201949id1_a.jpg", width=200)
      st.write("หลังจากที่ บรูซ เวยน์(คริสเตียน เบลล์) ได้กลายเป็นแบทแมน และปกป้องเมืองกอทแธม อย่างเต็มตัว เขาก็คอยจัดการกับเหล่าอาชญากรในเมืองนี้แม้ว่าจะถูกตำรวจ หมายหัวไปด้วยก็ตาม โดยเป้าหมายใหม่ของ แบทแมน คือการตามล่าตัว โจ๊กเกอร์ อาชญากรอัจฉริยะ ผู้อยู่เบื้องหลังการจราจลทั่วทั้งเมือง ในขณะเดียวกัน กอธแธม ก็ได้มี ฮาร์วีย์ เดนท์ อัยการไฟแรงผู้เปี่ยมไปด้วยอุดมการณ์ที่ต่อสู้เพื่อความยุติธรรม ที่ตัว บรูซ เองเชื่อมั่นว่าเขาจะสามารถเป็นฮีโร่คนใหม่ของกอทแธม แทนที่แบทแมน แต่พวกเขาหารู้ไม่ว่ากำลังได้ตกเป็นเป้าหมายสำคัญของ โจ๊กเกอร์ โดยไม่รู้ตัวหากให้พูดถึงงานที่เป็นมาสเตอร์พีซที่สุดของ โนแลน หนังเรื่องนี้จะต้องถูกพูดถึงเป็นอันดับแรก ๆ อย่างแน่นอน และทุกวันนี้หนังเรื่องนี้ก็เป็นทั้งหนังแบทแมน และหนังอาชญากรรมที่ยอดเยี่ยมที่สุดอีกเรื่อง ที่โลกใบนี้มีมา หนังมาพร้อมโทนเรื่องที่มืดหม่น จริงจัง โดยเฉพาะการพาคนดูไปพบกับความดำมืดของเมืองกอทแธม หนังเรื่องนี้ก็สามารถถ่ายทอดออกมาชัดเจนกว่าภาคที่แล้วมาก และสิ่งที่แบกหนังเกือบทั้งเรื่องไว้คือการแสดงครั้งสุดท้ายในชีวิคของ ฮีท เลทเจอร์ ในบทโจ๊กเกอร์ ที่ถ่ายทอดความวิปลาส ความคลั่ง และความเป็นอัจฉริยะของวายร้ายผู้นี้ออกมาได้อย่างทรงพลัง หนังสามารถคว้ามาได้ถึง 2 รางวัลออสการ์ได้แก่ นักแสดงสมทบยอดเยี่ยม (ฮีท เลทเจอร์) และตัดต่อเสียงยอดเยี่ยม(ริชาร์ด คิง)")
   with s5:
      st.header("12 Angry Men (1957)")
      st.image("12_Angry_Men_(1957_film_poster).jpg", width=200)
      st.write("เรื่องราวของ 12 ลูกขุน ที่กำลังประชุมเพื่อตัดสินคดีฆาตกรรม ที่มีผู้ต้องสงสัยคือเด็กชายคนหนึ่ง ท่ามกลางกระแสที่คนส่วนใหญ่ในห้องประชุมนี้ ต่างเตรียมตัดสินว่าเด็กชายดังกล่าว มีความผิดจริง ก็ได้มีชายคนหนึ่งลุกขึ้นมาโต้แย้งว่า บางทีเด็กคนดังกล่าวอาจไม่ได้เป็นคนลงมือ จนนำมาสู่ข้อโต้เถียงถึงคดีดังกล่าวอย่างเข้มข้นของคน 12 คน ที่มีชีวิตของคน 1 คนเป็นเดิมพันหนึ่งในผลงานขึ้นหิ้งของ ซิดนี่ย์ ลูเมตต์ เจ้าของผลงานสืบสวน ระทึกขวัญอย่าง Murder on the Orient Express และ Dog Day Afternoon ซึ่งความโดดเด่นของหนังเรื่องนี้ คือบทหนัง ที่ตลอดทั้งเรื่องเราจะได้เห็นคน 12 คนถกเถียงกันในห้อง ๆ เดียว โดยที่ไม่รู้สึกน่าเบื่อแม้แต่น้อย ด้วยความที่หนังพยายามหยิบประเด็นเรื่องศีลธรรม ความถูกต้อง และจิตสำนึกของคนมาเล่น ผสมกับการค่อย ๆ บอกใบ้วิธีการสืบสวน จากการอนุมานแบบต่าง ๆ ของตัวละคร ทำให้หนังเรื่องนี้น่าติดตาม และชวนลุ้นตั้งแต่ต้นยันจบ")
   with s6:
      st.header("Schindler's List (1993)")
      st.image("Schindler's_List_movie.jpg", width=200)
      st.write("หนังสร้างจากเรื่องจริงในช่วงสงครามโลกครั้งที่ 2 ของ ออสการ์ ชินด์เลอร์ นักธุรกิจชายเยอรมัน ที่ได้เดินทางมายังประเทศโปแลนด์เพื่อสร้างโรงงานของเขา จนกระทั่งกองทัพนาซี ได้ทำการไล่ล่าชาวโปแลนด์ที่มีเชื้อสายยิว เพื่อนำไปขัง และสังหารอย่างโหดเหี้ยม ซึ่งเหยื่อหลาย ๆ คนของโศกนาฎกรรมครั้งนี้ก็เป็นคนงานของ ชินด์เลอร์เอง หลังจากที่ ชินด์แลนด์ ได้เห็นความโหดร้ายมากมายของทหารนาซี เขาก็ได้ตัดสินใจช่วยเหลือคนงานชาวยิวของเขา ด้วยการใช้อำนาจ และเส้นสายในการสร้างรายชื่อชาวยิว ที่เขาพอจะสามารถพาอพยพ และหนีพ้นจากการตามล่าของทหารนาซีในครั้งนี้หนึ่งในผลงานที่ยอดเยี่ยมที่สุดตลอดกาลของพ่อมดแห่งวงการฮอลีวูดอย่าง สตีเวน สปีลเบิร์ก ที่ดัดแปลงมาจากนิยายของ โธมัส แคลเนียลลี่ โดย สปีลเบิร์กได้สะท้อนความโหดร้าย รุนแรงของสงครามโลกครั้งที่ 2 และทหารนาซี ออกมาได้อย่างหดหู่ น่าสะเทือนใจ แทบจะตลอด 3 ชั่วโมงของหนัง ประกอบกับการที่หนังใช้วิธีนำเสนอด้วยภาพขาวดำตลอดทั้งเรื่อง ที่ทำให้เรารู้สึกมืดหม่น และสะเทือนใจกับหนังเรื่องนี้ขึ้นไปอีก โดยเฉพาะฉากเด็กสาวชุดแดง ท่ามกลางสมรภูมิที่เต็มไปด้วยความตาย ได้เป็นฉากที่สะเทือนอารมณ์ และยากจะลืมเลือนของใครหลาย ๆ คน")
   with s7:
      st.header("The Lord of the Rings: The Return of the King (2003)")
      st.image("The_Lord_of_the_Rings,_TROTK_(2003).jpg", width=200)
      st.write("หนังภาคบทสรุปของมหากาพย์สงครามแหวนครองพิภพ เมื่อ อารากอนได้รวบรวมกองทัพ เพื่อที่จะถล่มมอร์ดอร์ และช่วย โฟรโด และแซม ที่กำลังเดินทางไปยังหุบเขาลาวาที่เป็นเตาหลอมสร้างแหวนขึ้นมา ท่ามกลางการนำทีมของ กอลลัม ที่ได้วางแผนร้ายเตรียมหักหลักพวกเขา และชิงแหวนกลับมาเป็นของตัวเองอีกคร้ง ท้ายที่สุดแล้ว โฟรโด จะสามารถทำลายแหวนได้หรือไม่ และอารากอนจะสามารถกอบกู้บัลลังก์ของ กอนดอร์ ในฐานะกษัตริย์ได้ไหม ไปลุ้นกันได้ใน The Lord of the Rings: The Return of the Kingบทสรุปของหนังไตรภาค และหนังสงครามที่ยอดเยี่ยมที่สุดตลอดกาล โดยหนังได้จัดเต็มด้วยฉากสงครามฟอร์มยักษ์ ระหว่างมนุษย์ และออร์ค ที่แม้ว่าจะผ่านเวลามาเกือบ 20 ปี แล้วก็ตาม ฉากสงครามในหนังเรื่องนี้ก็ยังยิ่งใหญ่ และน่าขนลุกทุกครั้งที่ได้ดู นอกจากนี้ พาร์ทดราม่าระหว่าง โฟรโด และแซม ที่แสดงโดย อีไลจาห์ วู้ด และฌอน ออสติน สามารถเรียกน้ำตาหลาย ๆ คนได้อย่างทรงพลัง การันตีคุณภาพด้วยการคว้ารางวัลออสการ์มาได้ถึง 11 รางวัล")
   with s8:
      st.header("Pulp Fiction (1994)")
      st.image("Pulp_Fiction_(1994)_poster.jpg", width=200)
      st.write("เรื่องราววุ่น ๆ ของโลกอาชญากรรม ที่นำทีมโดยสองนักฆ่าลูกน้องของเจ้าพ่ออย่าง วินเซนต์ และจูลส์ ที่คอยทำหน้าที่ตามทวงหนี้ และจัดการกับใครก็ตามที่คอยทรยศต่อแก๊ง นอกจากนี้ยังสอกแทรกไปด้วยความสัมพันธ์อันแสนวายป่วงมากมาย ไม่ว่าจะเป็น นักมวยที่ดันไม่ยอมล้มมวยตามที่ตกลงไว้ ,แฟนสาวของเจ้าพ่อที่ดันเสพยาเกินขนาด ไปจนถึงเจ้าพ่อที่ดันไปโดนเกย์จับข่มขืนผลงานลำดับที่ 2 ของ เควนติน ทารันทิโน ที่สร้างชื่อครั้งสำคัญให้เขา ด้วยความที่หนังเลือกที่จะฉีกทุกขนบของหนังที่ผ่านมาด้วยการเล่าเรื่องแบบไม่ลำดับเวลา พร้อมบทหนังสุดกวนที่จัดเต็มด้วยคำด่า F*ck ต่อเนื่องแบบไม่มีกั้ก ซึ่งแม้หนังจะเต็มไปด้วยบทพูดเกือบตลอด 2 ชั่วโมงครั้งของเรื่อง แต่มันกลับเป็นบทพูดที่ไม่น่าเบื่อ และมันส์ราวกับหนังแอคชั่น จนทำให้คอหนังทั่วโลก ล้วนแต่จดจำลายเซ็นของ ทารันทิโน ที่หนังของเขาจะมาพร้อมบทสุดเดือด พร้อมฉากฆ่ากันเลือดสาดแบบหนังเรท R อย่างแน่นอน")
   with s9:
      st.header("The Good, the Bad and the Ugly (1966)")
      st.image("Good_the_bad_and_the_ugly_poster.jpg", width=200)
      st.write("หนังว่าด้วยเรื่องราวของสามคาวบอย ที่ประกอบไปด้วย The Good นักแม่นปืน ที่มำอาชีพเป็นนักล่าค่าหัว ,The Bad นักฆ่ารับจ้าง ผู้โหดเหี้ยม และ The Ugly หัวขโมย และอาชญากรนอกกฏหมาย ที่ถูกทางการหมายหัว ซึ่งทั้งสามต้องมาโคจรเจอกัน โดยมีเงินของสมาพันธรัฐอเมริกา ที่มีจำนวนมากกว่า 200,000 เหรียญ ที่สูญหายไปในช่วงสงครามกลางเมืองมาข้องเกี่ยวผลงานการกำกับของ เซอร์จิโอ เลโอเน ซึ่งหนังเรื่องนี้ถือว่าเป็นภาคสุดท้ายของไตรภาค Dollars Trilogy ที่ได้เจ้าพ่อหนังคาวบอยหนังยุคนั้นอย่าง คลินท์ อีสต์วู้ด มารับบทเป็น The Good หรือคาวบอยไร้นาม ซึ่งหนีงเรื่องนี้ก็ถือว่าเป็นอีกหนึ่งบทพิสูจน์ถึงยุคเฟื่องฟูของหนังประเภท  Spaghetti Western แต่ในเรื่องนี้ได้นำเอาสูตรสำเร็จของหนังแนวนี้ มาถ่ายทอดให้ออกมามีชั้นเชิง และเปี่ยมไปด้วยเนื้อหาที่สนุก เข้มข้น และน่าติดตาม รวมทั้งดนตรีประกอบของ เอนนิโอ มอร์ริคอนเน ที่ยังคงติดหูมาจนถึงทุกวันนี้ ที่ฟังทีไรก็ต้องนึกถึงฉากดวลปืนในช่วงท้ายของหนังเรื่องนี้ขึ้นมาทันที")
   with s0:
      st.header("The Lord of the Rings: The Fellowship of the Ring (2001)") 
      st.image("The_Lord_of_the_Rings,_TFOTR_(2001).jpg", width=200)
      st.write("เรื่องราวของ มิดเดิ้ลเอิร์ธ โลกแฟนตาซีที่เต็มไปด้วยเผ่าพันธ์ และเรื่องมหัศจรรย์มากมาย จุดเริ่มต้นของเรื่องทั้งหมดเริ่มขึ้นเมื่อเซารอน วายร้ายแห่งดินแดนมอร์ดอร์ ได้ทำการสร้างแหวนครองพิภพขึ้นมา ซึ่งมันจะครอบงำจิตใจใครก็ตามที่ได้ครอบครอง จนกระทั่งมนุษย์ คนแคระ และเอลฟ์ ได้สร้างกองทัพเพื่อปราบเซารอน จนสำเร็จ แต่ทว่าแหวนกลับไม่ได้ถูกทำลาย และคอยครอบงำจิตใจใครก็ตามที่ครอบครอง จนกระทั่งมันได้ตกมาอยู่ในมือของ โฟรโด ชาวฮอบบิทที่ได้รับมรดกจากปู่ของเขา โดยเขาหารู้ไม่ว่ากำลังจะเป็นคนที่เปลี่+ยนแปลงมิดเดิลเอิร์ธไปตลอดกาลหนังภาคแรกของไตรภาค The Lord of the Rings ซึ่งกำกับโดย ปีเตอร์ แจ็คสัน ที่ดัดแปลงมาจากวรรณกรรมของ เจ อาร์ อาร์ โทลคีน ความน่าสนใจของหนังชุดนี้ คือการถ่ายทอดความยิ่งใหญ่ของ มิดเดิลเอิร์ธออกมาได้อย่างน่าสนใจ รวมทั้งเรื่องราวการผจญภัยที่น่าติดตาม พร้อมทั้งหนังยังได้สะท้อนจิตใจอันดำมืดจากความโลภของมนุษย์ได้เป็นอย่างดี ถือว่าเป็นหนังเปิดไตรภาคที่ทำออกมาได้น่าสนใจ ก่อนที่จะพาผู้ชมไปพบกับความยิ่งใหญ่แบบคูณ 2 ในสองภาคที่เหลือ")     
   
with x4:

    st.title('ให้คะเเนนเรา')
    review = st.text_area('เขียนรีวิวของคุณที่นี่')
    rating = st.slider('ให้คะแนนระดับ', min_value=0, max_value=10, step=1)
    if st.button('ส่งรีวิว'):
        if review:
            st.write('รีวิว:', review)
            st.write('คะแนน:', rating)
            st.success('รีวิวของคุณถูกส่งเรียบร้อยแล้ว!')
        else:
            st.warning('โปรดเขียนรีวิวก่อนส่ง')

   
